package com.example.tommynews.entity;

import java.io.Serializable;
import java.util.List;

public class NewsEntity {

    /**
     * msg : 获取成功
     * code : 200
     * data : [{"mode":1,"signature":"农加验地质了","name":"许秀兰","title":"能律红中观信论","body":"了作设与应运制研里易应阶后工分计压共两拉格候温能证平解了起政适就到响素总等种清断意越基响她以位子如例属劳安线器红看或类定院现本小间都心放路而但即权金特除商龙八记更油压求维如通约队日须成酸强电装出正色六感出红地南回传南至外及技到采派入文记机意至住情流部加决法火广海济目南叫了列王保严之别极划二究件切事命义江才连府名效那济说万农路很平分据素政江工合义心率平求导学学京问验体往自任间许社道构米周民安只内题被细感划加代党心织年程运太速强事热家做华必料维斗集发一空市量题各原组月月处况属律能至只重于上边得她名也七决使比划平比接花立际果科具都主学斗消有义花京度究员集走称实工效斯机者且示整备连速千制公经型非拉格非作认状矿九料任计由别九京电备期么建知九接的复院导人装单取周极议红装问习采非认能化状","email":"l.ioqrbkmqq@yoyj.mq","live":30},{"mode":1,"signature":"没族为身意圆市大证型联可义际较","name":"曾秀兰","title":"听史等性流","body":"面与运那段头八据小矿质接太见新集干风际影连性整温收天证色长市建则主年关学没又车革干米复资次亲始构外动事快常研一几马用还海解基或万元世响究列目达节志特思列局阶电这张连设响建切此制被定种科比人员一或用教性图报族整开意越酸可产应前马名力装证导老她包五取集半上市体千位与级做前比矿矿白头基体其术动者先听区看来个真斗更西如北战但所回种小清生上林去最速能要影表争手工量那压步数确月前对如正二月交因音选放此至老资其四果局在低从强这写质九明种光比之科约情石都半要她三果适革属单教分照出活包查出连单局产价二面支世却上半达复团任离家车许高变技连状立","email":"u.udqqbdv@kssvynsek.aw","live":51},{"mode":3,"signature":"强性许料值族高示阶议上金其保场","name":"周超","title":"里团值业求度","body":"系理和石省采圆观同重流气应听商定响平克压被式律级特建较人育江信海维属达史支放就并化各完门那流没路适则信利造志改情到头为整国天交速式干关资于多精器我越太你结代天常她北务大通区界整头太各类半值思验是角长话但划命区克有华三系革要白内质共格高单养器图我率经见则往系群会花自林日构选将非元张身了权规者见重后率确价委阶我示团至结状开感七世具行声查前形论至它开几厂要必得类技土单力完厂三各八长群则反院观示青酸近回据打须意给活它为外中业前这务特九构期儿只几角解号圆正织内低大很都特提发带时证历值回满即劳海听广极张引支区想回观精是过约属想百都京你具美他儿己放程理后他线边层带复构算据复此改不空从半离之还江术构万也研员提法为质马华习品今整思当式气律运合适半群今油好状是近如团工导置","email":"l.wcgv@ljmkv.gm","live":80},{"mode":2,"signature":"有七当象白条候两","name":"罗强","title":"加党可","body":"线类准对容达率收克志行式比业书叫大究提周却原其属往带果么热的林七发记求通统加素规土立个中进行选本而江金应者种入件以通为严参们组取个名复片被种石界什细油由再看全人八清复力别群当使完那些老书听住容步影空如千育因究工体清被京般之约对切少该反持矿子现见交太设教则大根要养但展运万身证派口究和问参场三水开合象决置线县八而存节开都极主是油级土府也类写太我平区角物定更什保义京算么律不厂价地持标品派运状状分须界连林议层写道容入动理府度原候斗少干上同层在圆算称构化定传消应安段调数没证划所等断因消究技西政往会风成问法根那石矿完般划","email":"u.zgkeyennv@gxkoa.qa","live":82},{"mode":4,"signature":"部上政文派断还更说见和象流管","name":"潘丽","title":"前太利国些小","body":"而强主国那半真公设走东易红技我车府线从维亲包候江青色划往大温红种真等色总支领至所看王总风基度回目为取济月干由理历华习近界变统得响况全发火越于气每义话收从应色得织第军太书些该风毛水龙员律身据着安转照团南制海除题酸安把证过放规元际际要年器月干家热也历书不件情子各空适省求种影马张府动二九品究规直或制事象不维六经千团才没响保教历越次都第去义体亲比深人列效则适太照品化便华选历自六结因由白求状参报中制按真题地革别了术自状个精铁织连形级化","email":"x.csghkcdmf@coql.ci","live":54},{"mode":1,"signature":"说过公需区油油百","name":"薛磊","title":"人角色","body":"与调直流则规界实做还量角类关党物处着得了支值要结开技白手长候如京达团过被月理响自些划安响受直保联果关住过运果细么技命标细五给县他且二间其相外但先只动儿整给比那内果备般式反三路铁号方关酸始义把百叫米交那他温日适易人花知信教法对在住备到众切划家近必强文何水斗复史需海千思给问意平分领声层亲一近作准青生况又义十给斗青然论角解劳果他在等消收图深话难流指风时事单界管龙部集快节石争青京明五好近越已二感治确证细性运理石量色布去或而做样阶传型看与美多原经么制世运干片是根严则报话织取究矿处能还府强每长自已养史事治共工原时取格学府重里极传温算道大米从理例算部系料级众标通东料火处始拉适主后高体法己层究如消进关真值严非后飞状老温京学断严土维织越权能那心民委民口光面命县地商维行国形需更时斯专一出计无已消重图公求战此将社没派龙些来委何局地区精题南任民式道级作林","email":"d.liopvw@vuwsn.by","live":15},{"mode":2,"signature":"之效再特容有周铁音究","name":"沈磊","title":"战放步外","body":"存新照改调图分之而及老据史小中眼这土县议构阶到关角重程术问走空步热保证任子和标外都话何想而层圆到率油边重格时集角分线约列全须较派象代他化派用经半离设运目从议求上算候确条当在开示报写日团生使已观半严况处众需么给即手调了际际油多南养交实其拉人段美间了张千成府单众段规备部部张名值极断把机看容构作状严格加打状区社与也备先列然即非水更等引点机单动收题亲管千目位有达目去带万她机线那团作山导好标次她术设开标些长便或好存带快格面据识风高记则做心设音单证持革非以口难八选她准数温效花影断拉低完林实者心需物油解老在那步克委资见代题好律毛工因很常自有值至认","email":"t.cfvlt@iincuqyb.pr","live":79},{"mode":1,"signature":"法最明党际或统三深","name":"董杰","title":"受至百元外","body":"许养命应始声长算红员京变难儿线百理广圆受其较办前满市新南派争三中入候满观复装小认用集治起位示张新马治候要算打话众写克结使做至相完面己自约外广只色专没值下史管方率保边水有正图日方式成该取然易状口都看时动十引效安集劳色了你者住她很线形及级主布起总他名直不路间按资更维任但须点问亲也技造经好起据器给候共今高律于万立备起花五离圆头斗能给育两队江复将全越算地了际口信少开规务口类特指论化图速军利能活统线广议然压月去管于广飞极元构列海具铁论志县新府教王边从组利直府月争平许格到都党以从际议白温该比周快头小与术感广及白省周才是走新越低会系天上成金就间因省确律问王快战多照除受报且提断见出提切高节引声步在需展术四千第细提取空车工任并事离复理义养眼必又所党机处以九难是低候听五军育力情龙见等","email":"b.khcg@qdv.cm","live":10},{"mode":3,"signature":"工是条眼准出际期积花象如年","name":"潘伟","title":"严又连权加据全","body":"究受石江干大深劳月单着六多活值是体即包此指头新学物及小往它深有建商命加资济现风心体受机好身行际治信号况快亲山果队前命感何指所关进果称商状先万风风但工受面当果流图向习快是新东表十运斗儿元关法再同想何打放值观料知段那金史美委很住年只一易主相专按事给区方众给易单经之府程日养战据信代劳利料斗组还听观作元厂影产形打小千装想青该第线造色阶火第从层感商千东子这思影断分然干八和进指太于严月须得属许除林铁始立些动半象手能任定土委压叫广安二其科速专斯适定求被标着已万下基准定受安条变半现是济象速取活立高很每清变手很利各各出响便方性构存北红面列层需变通京同多表力矿克才步美造建小对车厂高年教如声展就记公月老手何常该备型毛油度战且场五今务火指听手建科自动干原意文但持级根候亲身合安则两习小片声快条什信周之就应别一部装什己照己文果构指片文也具后计整力农他达据式青起二必务种需又深者长场需题认","email":"n.xnibqvcmm@ysqcuk.es","live":48},{"mode":1,"signature":"查查场列毛素八低决斗通方美争","name":"罗涛","title":"快边有必收还外","body":"划低济生被明传属界管最文实空会场头年大如心头比国被会代业青如好象处建民以率间张可南史现整数建特治运果再名于次少集林需回铁进眼千术性音增温报系力长色心有布家装外制机压县半四民关技育取国转路断金需连别然断件近重文多引约织道斯合四研效极色置这价率求价情约看清表面离社精快比方政龙志究七通化精果强山值龙传者际基先几意品着式决增给政说且水何角今包种构族规极和律手变团统斗一习中也较土做料维十圆指公决就是可办别叫响划适复时","email":"b.vipust@kstkc.az","live":54}]
     */
    private String msg;
    private String code;
    private List<DataEntity> data;

    public void setMsg(String msg) {
        this.msg = msg;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public void setData(List<DataEntity> data) {
        this.data = data;
    }

    public String getMsg() {
        return msg;
    }

    public String getCode() {
        return code;
    }

    public List<DataEntity> getData() {
        return data;
    }

    public class DataEntity implements Serializable {
        /**
         * mode : 1
         * signature : 农加验地质了
         * name : 许秀兰
         * title : 能律红中观信论
         * body : 了作设与应运制研里易应阶后工分计压共两拉格候温能证平解了起政适就到响素总等种清断意越基响她以位子如例属劳安线器红看或类定院现本小间都心放路而但即权金特除商龙八记更油压求维如通约队日须成酸强电装出正色六感出红地南回传南至外及技到采派入文记机意至住情流部加决法火广海济目南叫了列王保严之别极划二究件切事命义江才连府名效那济说万农路很平分据素政江工合义心率平求导学学京问验体往自任间许社道构米周民安只内题被细感划加代党心织年程运太速强事热家做华必料维斗集发一空市量题各原组月月处况属律能至只重于上边得她名也七决使比划平比接花立际果科具都主学斗消有义花京度究员集走称实工效斯机者且示整备连速千制公经型非拉格非作认状矿九料任计由别九京电备期么建知九接的复院导人装单取周极议红装问习采非认能化状
         * email : l.ioqrbkmqq@yoyj.mq
         * live : 30
         */
        private int mode;
        private String signature;
        private String name;
        private String title;
        private String body;
        private String email;
        private int live;

        public void setMode(int mode) {
            this.mode = mode;
        }

        public void setSignature(String signature) {
            this.signature = signature;
        }

        public void setName(String name) {
            this.name = name;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public void setBody(String body) {
            this.body = body;
        }

        public void setEmail(String email) {
            this.email = email;
        }

        public void setLive(int live) {
            this.live = live;
        }

        public int getMode() {
            return mode;
        }

        public String getSignature() {
            return signature;
        }

        public String getName() {
            return name;
        }

        public String getTitle() {
            return title;
        }

        public String getBody() {
            return body;
        }

        public String getEmail() {
            return email;
        }

        public int getLive() {
            return live;
        }
    }
}
